INSERT INTO item_categories (name, code_name) VALUES
    ('カテゴリー1', 'AK'),
    ('カテゴリー2', 'TA'),
    ('カテゴリー3', 'CD'),
    ('カテゴリー4', 'AC'),
    ('カテゴリー5', 'CB'),
    ('カテゴリー6', 'TB'),
    ('カテゴリー7', 'HB'),
    ('カテゴリー8', 'SB'),
    ('カテゴリー9', 'AF'),
    ('カテゴリー10', 'AS'),
    ('カテゴリー11', 'MI'),
    ('カテゴリー12', 'BP'),
    ('カテゴリー13', 'YW'),
    ('カテゴリー14', 'EC'),
    ('カテゴリー15', 'CT'),
    ('カテゴリー16', 'SK'),
    ('カテゴリー17', 'TP'),
    ('カテゴリー18', 'PM'),
    ('カテゴリー19', 'GN'),
    ('カテゴリー20', 'KC'),
    ('カテゴリー21', 'MP')
;

INSERT INTO makers (code_name) VALUES
    ('AA'),
    ('BB'),
    ('CC'),
    ('DD'),
    ('EE'),
    ('FF'),
    ('GG'),
    ('HH'),
    ('II'),
    ('JJ')
;
