INSERT INTO item_categories (name, code_name) VALUES
    ('アクリルキーホルダー', 'AK'),
    ('TDアクリルキーホルダー', 'TA'),
    ('ちょいデカアクリルキーホルダー', 'CD'),
    ('アクリルカード', 'AC'),
    ('缶バッジ', 'CB'),
    ('TD缶バッジ', 'TB'),
    ('ハート缶バッジ', 'HB'),
    ('スクエア缶バッジ', 'SB'),
    ('アクリルフィギュア', 'AF'),
    ('アクリルスタンド', 'AS'),
    ('ミニスタンド', 'MI'),
    ('ボールペン', 'BP'),
    ('やわらかクリアチャーム', 'YW'),
    ('木札ストラップ', 'EC'),
    ('クリアファイル3ポケット', 'CT'),
    ('ミニ色紙', 'SK'),
    ('スリムタペストリー', 'TP'),
    ('3Pメモ帳', 'PM'),
    ('B5ノート', 'GN'),
    ('巾着', 'KC'),
    ('マグカップ', 'MP')
;

INSERT INTO makers (code_name) VALUES
    ('SA'),
    ('MA'),
    ('NA'),
    ('IK'),
    ('UC'),
    ('TA'),
    ('SP'),
    ('KM'),
    ('KA'),
    ('SR')
;
