INSERT INTO maker (id, code_name) VALUES
    ('7fcc3a3f-3183-4776-a3df-292ab3562a40', 'AA'),
    ('3bdf061f-fd5d-4835-9e45-863cb103a4f1', 'BB'),
    ('cfe252e8-349f-436c-aa7f-34599f571648', 'CC'),
    ('486dd9a4-9a0a-4f04-9849-f41920233236', 'DD'),
    ('115dc03d-137e-4f69-98c4-c8ad8df269d7', 'EE'),
    ('1f515a3c-1095-4fff-862b-fba0c87aede4', 'FF'),
    ('805bccfa-8792-43e4-bcfa-1eebca58f35d', 'GG'),
    ('745f4311-a66e-48c2-ba86-ee63c6ec1dc2', 'HH'),
    ('2dc57c24-1786-4f4f-88aa-f84fe900af8b', 'II'),
    ('c5ed3f9b-78e0-46e0-8c5e-503334d585f1', 'JJ')
;

INSERT INTO title (id, name, release_date, reservation_start_date, reservation_deadline, order_date_to_maker, project_type) VALUES
    ('14cdac42-34b6-43d3-bfdf-d11b3529e9f2', 'title1', '2022-05-04T04:24:22+09:00', '2022-03-04T04:24:22+09:00', '2022-04-04T04:24:22+09:00', '2022-04-06T04:24:22+09:00', 'A案件'),
    ('76ade907-eae0-4647-9a3b-f43ae4eb2523', 'title2', '2022-06-04T04:24:22+09:00', '2022-04-04T04:24:22+09:00', '2022-05-04T04:24:22+09:00', '2022-05-06T04:24:22+09:00', 'Y案件'),
    ('e2b8910d-7bce-4e89-8d08-8dfe8ff192da', 'title3', '2022-07-04T04:24:22+09:00', '2022-05-04T04:24:22+09:00', '2022-06-04T04:24:22+09:00', '2022-06-06T04:24:22+09:00', '再販'),
    ('7d5ff33f-11dd-4a1b-a42b-df0fa8552864', 'title4', '2022-08-04T04:24:22+09:00', '2022-06-04T04:24:22+09:00', '2022-07-04T04:24:22+09:00', '2022-07-06T04:24:22+09:00', 'デフォルト'),
    ('2278c8cd-ea44-49dd-9a19-634fdb0d0902', 'title5', '2022-09-04T04:24:22+09:00', '2022-07-04T04:24:22+09:00', '2022-08-04T04:24:22+09:00', '2022-08-06T04:24:22+09:00', 'デフォルト'),
    ('d3551b12-c4fb-46ec-b5d8-4ba56fe93934', 'title6', '2022-10-04T04:24:22+09:00', '2022-08-04T04:24:22+09:00', '2022-09-04T04:24:22+09:00', '2022-09-06T04:24:22+09:00', 'デフォルト'),
    ('11fc0c04-93c7-4a88-958c-cab97ec8f524', 'title7', '2022-11-04T04:24:22+09:00', '2022-09-04T04:24:22+09:00', '2022-10-04T04:24:22+09:00', '2022-10-06T04:24:22+09:00', 'デフォルト'),
    ('d32dbd54-e4bf-428b-8200-58824677a96f', 'title8', '2022-12-04T04:24:22+09:00', '2022-10-04T04:24:22+09:00', '2022-11-04T04:24:22+09:00', '2022-11-06T04:24:22+09:00', 'デフォルト'),
    ('5f28aa6e-5982-496f-8bb7-015162e23778', 'title9', '2023-01-04T04:24:22+09:00', '2022-11-04T04:24:22+09:00', '2022-12-04T04:24:22+09:00', '2022-12-06T04:24:22+09:00', 'デフォルト'),
    ('75cccb47-3e59-4f86-bec9-44f595915501', 'title10', '2023-02-04T04:24:22+09:00', '2022-12-04T04:24:22+09:00', '2023-01-04T04:24:22+09:00', '2023-01-06T04:24:22+09:00', 'デフォルト')
;

INSERT INTO worker (id, name) VALUES
    ('32e4d284-f532-437f-99dd-02a7ece7481d', 'name1'),
    ('8b4e3cdc-5f42-4529-8df4-d6b929a96f87', 'name2'),
    ('fcd113d5-81a3-443e-b5e1-8d71261f385a', 'name3'),
    ('0b0404c8-8157-47d6-8b36-38099ce6d748', 'name4'),
    ('fc80f9c0-dfb9-47a1-b7ce-65dcc13f63dc', 'name5'),
    ('5664e8a6-2022-47f7-a420-1bdbd1030788', 'name6'),
    ('ae3f4c87-48d4-4049-a09a-3942cdcdf990', 'name7'),
    ('c085fe4a-5c7d-4cb8-9d38-bca895a7b20c', 'name8'),
    ('565aeddc-e58a-49c6-b3f4-2ff02c5a39c0', 'name9'),
    ('0595132c-a285-4572-a969-09ee29abb44d', 'name10')
;

INSERT INTO item (
    id,
    title_id,
    name,
    product_code,
    sku,
    illust_status,
    pic_illust_id,
    design_status,
    pic_design_id,
    maker_id,
    retail_price,
    double_check_person_id,
    catalog_status,
    announcement_status,
    remarks
) VALUES
    (
        gen_random_uuid(),
        '14cdac42-34b6-43d3-bfdf-d11b3529e9f2',
        'sample1',
        'ABC-EFG',
        null,
        '未着手',
        null,
        '未着手',
        null,
        null,
        1000,
        null,
        '未着手',
        '未着手',
        null
    ),
    (
        gen_random_uuid(),
        '76ade907-eae0-4647-9a3b-f43ae4eb2523',
        'sample2',
        'AAA-11235',
        5,
        'イラスト納品待ち',
        '32e4d284-f532-437f-99dd-02a7ece7481d',
        '素材提供待ち',
        '8b4e3cdc-5f42-4529-8df4-d6b929a96f87',
        '3bdf061f-fd5d-4835-9e45-863cb103a4f1',
        500,
        'fcd113d5-81a3-443e-b5e1-8d71261f385a',
        '未着手',
        '未着手',
        '備考'
     )
;
